app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"  ORDER BY created_at DESC
---
	def index
		@articles = Article.all.order("created_at DESC")

INSERT INTO "articles" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Welcome To LFA"], ["content", "This is a welcome note to Learning For All."], ["user_id", 1], ["created_at", "2015-02-26 20:31:36.186634"], ["updated_at", "2015-02-26 20:31:36.186634"]]
---
	def create
		@article = current_user.articles.build(article_params)
		if @article.save